---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionStructuralTees.BoltDiameter
source: html/e4ca0fd5-4831-be12-f090-af08bab90f32.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionStructuralTees.BoltDiameter Property

Maximum bolt hole diameter, in. (mm)

## Syntax (C#)
```csharp
public double BoltDiameter { get; set; }
```